import React, { Fragment } from 'react';

const MainPage = () => {
	return (
		<Fragment>
			<h1 className="uk-heading-divider">Главная страница</h1>
			Добрый день!
			<br /><br/>
			По вашей просьбе при дизайне применялись элементы библиотеки UIkit.
			<br /><br/>
			В основу проекта заложена архитектура, применяемая в команде где я сейчас.
			<br /><br/>
			Избыточность (на первый взгляд) папок и файлов перебивается возможностью масштабирования проекта и
			переиспользования файлов.
			<br /><br/>
			В мок-файлах предопределен процент ошибок (и ошибок сервера, и ошибок связи) для реализации их обработки.
			<br /><br/>
			Функциональность редьюсера фильтрации увеличена для показания чанкования. По факту это всё должно делаться
			на сервере (ну вы знаете :)
			<br /><br/>
			Вся бизнес-логика реализована через Redux.
			<br /><br/>
			логин - aa
			<br />
			пароль - 11
			<br />
		</Fragment>
	);
};

export default MainPage;
